<?php
/**
 * Strings for component 'report_competency_statistic'
 *
 * @package    coursereport
 * @subpackage competency_statistic
 * @copyright  2022
 * @license    -
 */

$string['reportname'] = 'Статистика компетенций';
$string['pluginname'] = 'Статистика компетенций';
$string['strftimetime'] = '%I:%M:%S %p';
$string['viewlogs'] = 'View logs';
$string['statistic_help'] = '<ul><li>Статистика по курсу - это статистика освоения компетенций по текущему курсу. </li><li>Статистика по курсам - это статистика освоения компетенций по всем изучаемым курсам. </li><li>Освоенные компетенции - это компетенции, освоенные за всё время обучения.</ul>';
$string['statistic_for_course_help'] = 'На левой диаграмме показаны освоенные компетенции по текущему курсу. <p>На правой диаграмме показано количество выполненных заданий по освоенным компетенциям. Серым цветом отмечены неосвоенные компетенции и невыполненные задания.';
$string['statistic_for_all_competencies_help'] = 'На круговой диаграмме показаны все освоенные компетенции студента за предыдущие семестры обучения. Для каждой компетенции в скобках указано количество дисциплин, закрывающих данную компетенцию, и через двоеточие указан средний балл за экзамены за соответствующие компетенциям дисциплины.';
$string['statistic_for_all_course_help'] = 'На круговой диаграмме показаны все освоенные студентом компетенции по текущим изучаемым дисциплинам.';
